{
  "articles": [
    {
      "id": "1",
      "title": "Making a Realistic Glass Effect with SVG",
      "shortDescription": "Your designers can rest easy knowing they don't have to reproduce an effect for every article or product on your site.",
      "rating": 3.75,
      "ratingCount": 14
    },
    {
      "id": "2",
      "title": "Frontend design, react, and a bridge over the great divide",
      "shortDescription": "Frontend designers create the HTML, CSS, and presentational JavaScript code that powers web products’ user interfaces. I see frontend design as helpful mortar that bridges the gap between design and development.",
      "rating": 2.75,
      "ratingCount": 18
    },
    {
      "id": "3",
      "title": "How to sync props to state properly in React Hooks",
      "shortDescription": "Its a simple component which accepts props. We pass this props as initialState to useState.Now, what will happen if the props get changed and does the state get changed and re-render?",
      "rating": 3.35,
      "ratingCount": 33
    },
    {
      "id": "4",
      "title": "Frontend vs Backend",
      "shortDescription": "Frontend is about perception. When we build Frontend things, we care a lot about how users perceive what we built. We spend an ungodly amount of time asking these questions (so much that countless jobs were created for each of them).",
      "rating": 4.85,
      "ratingCount": 109
    },
    {
      "id": "5",
      "title": "Using Prettier with Airbnb's ESLint config",
      "shortDescription": "What is Prettier and Airbnb’s ESlint configuration. Airbnb ESLint configuration is one of the most used ESLint configuration and Prettier is an opinionated code formatter with a handful options.",
      "rating": 2.08,
      "ratingCount": 9
    }
  ],
  "fullArticles": [
    {
      "id": 1,
      "title": "Making a Realistic Glass Effect with SVG",
      "content": "Content for article 1"
    },
    {
      "id": 2,
      "title": "Frontend design, react, and a bridge over the great divide",
      "content": "Content for article 2"
    },
    {
      "id": 3,
      "title": "How to sync props to state properly in React Hooks",
      "content": "Content for article 3"
    },
    {
      "id": 4,
      "title": "Frontend vs Backend",
      "content": "Content for article 4"
    },
    {
      "id": 5,
      "title": "Using Prettier with Airbnb's ESLint config",
      "content": "Content for article 5"
    }
  ]
}